#编写一个
SQL 查询来对分数进行排名.排名应按以下规则计算:
#分数应该从高到低排列.
#如果两个分数之间存在平局,则两者应具有相同的排名.
#平局后,下一个排名数字应该是下一个连续的整数值.
#换句话说,行列之间不应该有漏洞.返回按分数降序排列的结果表. 查询结果格式如下例.
Input:
Scores table:
+----+-------+
| id | score |
+----+-------+
| 1  | 3.50  |
| 2  | 3.65  |
| 3  | 4.00  |
| 4  | 3.85  |
| 5  | 4.00  |
| 6  | 3.65  |
+----+-------+
Output:
+-------+------+
| score | rank |
+-------+------+
| 4.00  | 1    |
| 4.00  | 1    |
| 3.85  | 2    |
| 3.65  | 3    |
| 3.65  | 3    |
| 3.50  | 4    |
+-------+------+

select score, DENSE_RANK() over (order by score desc) 'rank'
from Scores;